app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2018-06-03 20:36:33.216203"], ["id", 1]]