app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2018-06-03 20:46:14.356606"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name))